In [20]:
import pandas as pd
from pandas import DataFrame, Series

In [21]:
d = {
    'name' : Series(['Braund', 'Cummings', 'Heikkinen', 'Allen'], index=['a', 'b', 'c', 'd']),
    'age' : Series([22, 38, 26, 35], index=['a', 'b', 'c', 'd']),
    'fare' : Series([7.25, 71.83, 8.05], index=['a', 'b', 'd']),
    'survived?' : Series([False, True, True, False], index=['a', 'b', 'c', 'd'])
}

df = DataFrame(d2)
df

        name  age   fare  survived?
a     Braund   22   7.25      False
b   Cummings   38  71.83       True
c  Heikkinen   26    NaN       True
d      Allen   35   8.05      False

In [22]:
df['name']

a       Braund
b     Cummings
c    Heikkinen
d        Allen
Name: name, dtype: object

In [23]:
df[['name', 'age']]

        name  age
a     Braund   22
b   Cummings   38
c  Heikkinen   26
d      Allen   35

In [24]:
df[['name', 'age', 'fare']]

        name  age   fare
a     Braund   22   7.25
b   Cummings   38  71.83
c  Heikkinen   26    NaN
d      Allen   35   8.05

In [25]:
df.loc['a']

name         Braund
age              22
fare           7.25
survived?     False
Name: a, dtype: object

In [26]:
df.loc[['a','b']]

       name  age   fare  survived?
a    Braund   22   7.25      False
b  Cummings   38  71.83       True

In [46]:
# df.iloc['a']
# TypeError 
# TypeError: Cannot index by location index with a non-integer key

In [27]:
df[:]

        name  age   fare  survived?
a     Braund   22   7.25      False
b   Cummings   38  71.83       True
c  Heikkinen   26    NaN       True
d      Allen   35   8.05      False

In [43]:
df[1:3]

        name  age   fare  survived?
b   Cummings   38  71.83       True
c  Heikkinen   26    NaN       True

In [28]:
df[df['age'] >= 30] # age greater than or equal to 30

       name  age   fare  survived?
b  Cummings   38  71.83       True
d     Allen   35   8.05      False

In [29]:
df['survived?'][df['age'] > 30] # all survived? status only for age>=30

b     True
d    False
Name: survived?, dtype: bool

In [33]:
df2 = df[['name']]
df2, type(df2)

(        name
 a     Braund
 b   Cummings
 c  Heikkinen
 d      Allen,
 pandas.core.frame.DataFrame)

In [38]:
# df3 = df[[['name']]]
# df3, type(df3)
# KeyError

In [40]:
df[['name', 'survived?']][df['age'] > 30]

       name  survived?
b  Cummings       True
d     Allen      False